app/Controllers/Asientoscontroller.php

SELECT *
FROM `asientos`
---
    public function index(): string
    {
        //crear un objeto AsientoModel
        $asiento = new AsientoModel();
        $datos['datos']=$asiento->findAll();