app/Controllers/Detalles_Reservas_Controller.php

    public function index(): string
    {
        //crear un objeto DetalleReservaModel
        $detallereserva = new DetalleReservaModel();
        $datos['datos']=$detallereserva->findAll();
---
SELECT *
FROM `detalle_reserva`