app/Controllers/FuncionesController.php

SELECT *
FROM `funciones`
---
    public function listar()
    {
        $funcionModel = new FuncionModel();
        $datos['funciones'] = $funcionModel->findAll();

SELECT *
FROM `funciones`
WHERE `funciones`.`funcion_id` = '1'
---
    public function editar($id)
    {
        $funcionModel = new FuncionModel();
        $datos['funcion'] = $funcionModel->find($id);
        if (!$datos['funcion']) {
            return redirect()->to(base_url('funciones/listar'))
                           ->with('error', 'La función no existe.');