app/Controllers/GenerosController.php

    public function listar()
    {
        $generoModel = new GeneroModel();
        $datos['generos'] = $generoModel->findAll();
---
SELECT *
FROM `genero`

public function guardar()
    {
        $generoModel = new GeneroModel();
        $nombre = $this->request->getPost('nombre');

        $existe = $generoModel->where('nombre', $nombre)->first();
---
SELECT *
FROM `genero`
WHERE `nombre` = 'terror'
 LIMIT 1