app/Controllers/LoginController.php

    public function autenticar(){
        $session = session();
        $usuarioModel = new UsuarioModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $usuario = $usuarioModel->where('email', $email)->first();

        if($usuario){
            if($usuario['activo'] != 1){
                return redirect()->back()->with('error','Usuario bloqueado');
            }

            if(password_verify($password, $usuario['password'])){
                $session->regenerate();
                $sessionData = [
                    'id' => $usuario['usuario_id'],
                    'nombre' => $usuario['nombre'],
                    'tipo_usuario' => $usuario['tipo_usuario'],
                    'logged_in' => true
                ];
                $session->set($sessionData);

                // Actualizar último acceso
                $usuarioModel->update($usuario['usuario_id'], ['ultimo_acceso' => date('Y-m-d H:i:s')]);
---
SELECT *
FROM `usuarios`
WHERE `email` = 'admin@correo.com'
 LIMIT 1
UPDATE `usuarios` SET `ultimo_acceso` = '2025-10-22 00:34:52'
WHERE `usuarios`.`usuario_id` IN ('110')