app/Controllers/MoviesController.php

SELECT *
FROM `peliculas`
---
    public function index()
    {
        $peliculaModel = new PeliculaModel();

        $data['peliculas'] = $peliculaModel->findAll();