app/Controllers/ReservarController.php

SELECT *
FROM `peliculas`
WHERE `peliculas`.`id` = '1'
---
    public function index($id)
    {
        $peliculaModel = new PeliculaModel();
        $funcionModel  = new FuncionModel();

        $pelicula = $peliculaModel->find($id);

SELECT *
FROM `peliculas`
WHERE `peliculas`.`id` = '1'
SELECT *
FROM `asientos`
WHERE `sala_id` = '2'
---
   public function asientos()
{
    $funcion_id = $this->request->getGet('funcion_id');

    $funcionModel  = new FuncionModel();
    $peliculaModel = new PeliculaModel();
    $asientoModel  = new \App\Models\AsientoModel();

    $funcion = $funcionModel->find($funcion_id);
    if (!$funcion) {
        throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound('Función no encontrada');
    }

    $pelicula = $peliculaModel->find($funcion['pelicula_id']);

    // Obtener todos los asientos de la sala
    $asientos = $asientoModel->where('sala_id', $funcion['sala_id'])->findAll();

SELECT *
FROM `peliculas`
WHERE `peliculas`.`id` = '1'
---
public function detalle()
{
    $session = session();
    $usuario_id = $session->get('usuario_id');

    if (!$usuario_id) {
        return redirect()->to('/login')->with('error', 'Debes iniciar sesión para reservar.');
    }

    $asientosSeleccionados = $this->request->getPost('asiento_seleccionado');
    $funcion_id = $this->request->getPost('funcion_id');
    $fecha_reserva = date('Y-m-d H:i:s');

    if (empty($asientosSeleccionados)) {
        return redirect()->back()->with('error', 'Debes seleccionar al menos un asiento.');
    }

    $reservaModel = new \App\Models\ReservaModel();
    $funcionModel = new \App\Models\FuncionModel();
    $peliculaModel = new \App\Models\PeliculaModel();
    $asientoModel = new \App\Models\AsientoModel();
    $reservaAsientoModel = new \App\Models\ReservaAsientoModel();

    // 1️⃣ Obtener datos de la función y película
    $funcion = $funcionModel->find($funcion_id);
    $pelicula = $peliculaModel->find($funcion['pelicula_id']);

SELECT *
FROM `asientos`
WHERE `asientos`.`asiento_id` = '157'
---
    $total_asientos = 0;
    $asientos = [];
    foreach ($asientosSeleccionados as $asiento_id) {
        $asiento = $asientoModel->find($asiento_id);

INSERT INTO `reservas` (`usuario_id`, `funcion_id`, `total`, `fecha_reserva`, `codigo_qr`) VALUES ('1', '32', 95, '2025-10-27 13:24:41', NULL)
---
    $total_pagar = $precio_funcion + $total_asientos;

    // 4️⃣ Guardar la reserva
    $reservaModel->insert([
        'usuario_id' => $usuario_id,
        'funcion_id' => $funcion_id,
        'total' => $total_pagar,
        'fecha_reserva' => $fecha_reserva,
        'codigo_qr' => null
    ]);

INSERT INTO `reserva_asiento` (`reserva_id`, `asiento_id`, `precio`, `fecha_creacion`) VALUES (1043, '157', '50.00', '2025-10-27 13:24:41')
---

    // 5️⃣ Guardar los asientos en la tabla reserva_asiento
    foreach ($asientos as $a) {
        $reservaAsientoModel->insert([
            'reserva_id' => $reserva_id,
            'asiento_id' => $a['asiento_id'],
            'precio' => $a['precio'] // precio del asiento
        ]);

UPDATE `reservas` SET `codigo_qr` = 'https://api.qrserver.com/v1/create-qr-code/?size=150x150&data=Reserva%3A+A7%0APel%C3%ADcula%3A+La+Sombra+del+Guerrero%0AFunci%C3%B3n%3A+2025-09-22+22%3A30%3A00%0ATotal+a+pagar%3A+Q95.00'
WHERE `reservas`.`reserva_id` IN (1043)
---
    $codigo_qr = "https://api.qrserver.com/v1/create-qr-code/?size=150x150&data=" . urlencode($qrContent);

    // 7️⃣ Actualizar la reserva con QR
    $reservaModel->update($reserva_id, ['codigo_qr' => $codigo_qr]);