app/Controllers/UsuariosController.php

    public function vistaUsuarios(): string
    {
        $usuario = new UsuarioModel();
        $datos['datos'] = $usuario->findAll();
---
SELECT *
FROM `usuarios`

   public function buscarUsuario($id)
{
    $usuario = new UsuarioModel();
    $usuario = $usuario->find($id);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`usuario_id` = '1'